---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAlreadyAttachedToCurrentLevel
source: html/eb80377f-f407-ce35-3b98-757f8683254c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAlreadyAttachedToCurrentLevel Property

Mutistory Stairs already have a Stair attaching to this level.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsAlreadyAttachedToCurrentLevel { get; }
```